Tutorials-3.0.1/hemisph-2-cav1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.16; //20;

deltaT          2.5e-6; //1e-06;

writeControl    adjustableRunTime;

writeInterval   5e-4; //10; //50; //10; //1e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  true;

maxCo           0.5;

maxDeltaT	1e-4;

CourantType	faceCourant;

libs ("libcompressibleTools.so");

// ************************************************************************* //
